7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_DFSDM.h
#define Get_DFSDM_DFSDM_CHCFG0R1(FLAG)       (*(uint32_t*)0x40017400 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG1R1(FLAG)       (*(uint32_t*)0x40017420 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG2R1(FLAG)       (*(uint32_t*)0x40017440 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG3R1(FLAG)       (*(uint32_t*)0x40017460 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG4R1(FLAG)       (*(uint32_t*)0x40017480 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG5R1(FLAG)       (*(uint32_t*)0x400174a0 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG6R1(FLAG)       (*(uint32_t*)0x400174c0 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG7R1(FLAG)       (*(uint32_t*)0x400174e0 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG0R2(FLAG)       (*(uint32_t*)0x40017404 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG1R2(FLAG)       (*(uint32_t*)0x40017424 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG2R2(FLAG)       (*(uint32_t*)0x40017444 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG3R2(FLAG)       (*(uint32_t*)0x40017464 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG4R2(FLAG)       (*(uint32_t*)0x40017484 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG5R2(FLAG)       (*(uint32_t*)0x400174a4 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG6R2(FLAG)       (*(uint32_t*)0x400174c4 & FLAG)
#define Get_DFSDM_DFSDM_CHCFG7R2(FLAG)       (*(uint32_t*)0x400174e4 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD0R(FLAG)        (*(uint32_t*)0x40017408 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD1R(FLAG)        (*(uint32_t*)0x40017428 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD2R(FLAG)        (*(uint32_t*)0x40017448 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD3R(FLAG)        (*(uint32_t*)0x40017468 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD4R(FLAG)        (*(uint32_t*)0x40017488 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD5R(FLAG)        (*(uint32_t*)0x400174a8 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD6R(FLAG)        (*(uint32_t*)0x400174c8 & FLAG)
#define Get_DFSDM_DFSDM_AWSCD7R(FLAG)        (*(uint32_t*)0x400174e8 & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT0R(FLAG)       (*(uint32_t*)0x4001740c & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT1R(FLAG)       (*(uint32_t*)0x4001742c & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT2R(FLAG)       (*(uint32_t*)0x4001744c & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT3R(FLAG)       (*(uint32_t*)0x4001746c & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT4R(FLAG)       (*(uint32_t*)0x4001748c & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT5R(FLAG)       (*(uint32_t*)0x400174ac & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT6R(FLAG)       (*(uint32_t*)0x400174cc & FLAG)
#define Get_DFSDM_DFSDM_CHWDAT7R(FLAG)       (*(uint32_t*)0x400174ec & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN0R(FLAG)      (*(uint32_t*)0x40017410 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN1R(FLAG)      (*(uint32_t*)0x40017430 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN2R(FLAG)      (*(uint32_t*)0x40017450 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN3R(FLAG)      (*(uint32_t*)0x40017470 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN4R(FLAG)      (*(uint32_t*)0x40017490 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN5R(FLAG)      (*(uint32_t*)0x400174b0 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN6R(FLAG)      (*(uint32_t*)0x400174d0 & FLAG)
#define Get_DFSDM_DFSDM_CHDATIN7R(FLAG)      (*(uint32_t*)0x400174f0 & FLAG)
#define Get_DFSDM_DFSDM0_CR1(FLAG)           (*(uint32_t*)0x40017500 & FLAG)
#define Get_DFSDM_DFSDM1_CR1(FLAG)           (*(uint32_t*)0x40017580 & FLAG)
#define Get_DFSDM_DFSDM2_CR1(FLAG)           (*(uint32_t*)0x40017600 & FLAG)
#define Get_DFSDM_DFSDM3_CR1(FLAG)           (*(uint32_t*)0x40017780 & FLAG)
#define Get_DFSDM_DFSDM0_CR2(FLAG)           (*(uint32_t*)0x40017504 & FLAG)
#define Get_DFSDM_DFSDM1_CR2(FLAG)           (*(uint32_t*)0x40017584 & FLAG)
#define Get_DFSDM_DFSDM2_CR2(FLAG)           (*(uint32_t*)0x40017604 & FLAG)
#define Get_DFSDM_DFSDM3_CR2(FLAG)           (*(uint32_t*)0x40017784 & FLAG)
#define Get_DFSDM_DFSDM0_ISR(FLAG)           (*(uint32_t*)0x40017508 & FLAG)
#define Get_DFSDM_DFSDM1_ISR(FLAG)           (*(uint32_t*)0x40017588 & FLAG)
#define Get_DFSDM_DFSDM2_ISR(FLAG)           (*(uint32_t*)0x40017608 & FLAG)
#define Get_DFSDM_DFSDM3_ISR(FLAG)           (*(uint32_t*)0x40017788 & FLAG)
#define Get_DFSDM_DFSDM0_ICR(FLAG)           (*(uint32_t*)0x4001750c & FLAG)
#define Get_DFSDM_DFSDM1_ICR(FLAG)           (*(uint32_t*)0x4001758c & FLAG)
#define Get_DFSDM_DFSDM2_ICR(FLAG)           (*(uint32_t*)0x4001760c & FLAG)
#define Get_DFSDM_DFSDM3_ICR(FLAG)           (*(uint32_t*)0x4001778c & FLAG)
#define Get_DFSDM_DFSDM0_JCHGR(FLAG)         (*(uint32_t*)0x40017510 & FLAG)
#define Get_DFSDM_DFSDM1_JCHGR(FLAG)         (*(uint32_t*)0x40017590 & FLAG)
#define Get_DFSDM_DFSDM2_JCHGR(FLAG)         (*(uint32_t*)0x40017610 & FLAG)
#define Get_DFSDM_DFSDM3_JCHGR(FLAG)         (*(uint32_t*)0x40017710 & FLAG)
#define Get_DFSDM_DFSDM0_FCR(FLAG)           (*(uint32_t*)0x40017514 & FLAG)
#define Get_DFSDM_DFSDM1_FCR(FLAG)           (*(uint32_t*)0x40017594 & FLAG)
#define Get_DFSDM_DFSDM2_FCR(FLAG)           (*(uint32_t*)0x40017614 & FLAG)
#define Get_DFSDM_DFSDM3_FCR(FLAG)           (*(uint32_t*)0x40017714 & FLAG)
#define Get_DFSDM_DFSDM0_JDATAR(FLAG)        (*(uint32_t*)0x40017518 & FLAG)
#define Get_DFSDM_DFSDM1_JDATAR(FLAG)        (*(uint32_t*)0x40017598 & FLAG)
#define Get_DFSDM_DFSDM2_JDATAR(FLAG)        (*(uint32_t*)0x40017618 & FLAG)
#define Get_DFSDM_DFSDM3_JDATAR(FLAG)        (*(uint32_t*)0x40017718 & FLAG)
#define Get_DFSDM_DFSDM0_RDATAR(FLAG)        (*(uint32_t*)0x4001751c & FLAG)
#define Get_DFSDM_DFSDM1_RDATAR(FLAG)        (*(uint32_t*)0x40017598 & FLAG)
#define Get_DFSDM_DFSDM2_RDATAR(FLAG)        (*(uint32_t*)0x40017618 & FLAG)
#define Get_DFSDM_DFSDM3_RDATAR(FLAG)        (*(uint32_t*)0x40017718 & FLAG)
#define Get_DFSDM_DFSDM0_AWHTR(FLAG)         (*(uint32_t*)0x40017520 & FLAG)
#define Get_DFSDM_DFSDM1_AWHTR(FLAG)         (*(uint32_t*)0x400175a0 & FLAG)
#define Get_DFSDM_DFSDM2_AWHTR(FLAG)         (*(uint32_t*)0x40017620 & FLAG)
#define Get_DFSDM_DFSDM3_AWHTR(FLAG)         (*(uint32_t*)0x400176a0 & FLAG)
#define Get_DFSDM_DFSDM0_AWLTR(FLAG)         (*(uint32_t*)0x40017524 & FLAG)
#define Get_DFSDM_DFSDM1_AWLTR(FLAG)         (*(uint32_t*)0x400175a4 & FLAG)
#define Get_DFSDM_DFSDM2_AWLTR(FLAG)         (*(uint32_t*)0x40017624 & FLAG)
#define Get_DFSDM_DFSDM3_AWLTR(FLAG)         (*(uint32_t*)0x400176a4 & FLAG)
#define Get_DFSDM_DFSDM0_AWSR(FLAG)          (*(uint32_t*)0x40017528 & FLAG)
#define Get_DFSDM_DFSDM1_AWSR(FLAG)          (*(uint32_t*)0x400175a8 & FLAG)
#define Get_DFSDM_DFSDM2_AWSR(FLAG)          (*(uint32_t*)0x40017628 & FLAG)
#define Get_DFSDM_DFSDM3_AWSR(FLAG)          (*(uint32_t*)0x400176a8 & FLAG)
#define Get_DFSDM_DFSDM0_AWCFR(FLAG)         (*(uint32_t*)0x4001752c & FLAG)
#define Get_DFSDM_DFSDM1_AWCFR(FLAG)         (*(uint32_t*)0x400175ac & FLAG)
#define Get_DFSDM_DFSDM2_AWCFR(FLAG)         (*(uint32_t*)0x4001762c & FLAG)
#define Get_DFSDM_DFSDM3_AWCFR(FLAG)         (*(uint32_t*)0x400176ac & FLAG)
#define Get_DFSDM_DFSDM0_EXMAX(FLAG)         (*(uint32_t*)0x40017530 & FLAG)
#define Get_DFSDM_DFSDM1_EXMAX(FLAG)         (*(uint32_t*)0x400175b0 & FLAG)
#define Get_DFSDM_DFSDM2_EXMAX(FLAG)         (*(uint32_t*)0x40017630 & FLAG)
#define Get_DFSDM_DFSDM3_EXMAX(FLAG)         (*(uint32_t*)0x400176b0 & FLAG)
#define Get_DFSDM_DFSDM0_EXMIN(FLAG)         (*(uint32_t*)0x40017534 & FLAG)
#define Get_DFSDM_DFSDM1_EXMIN(FLAG)         (*(uint32_t*)0x400175b4 & FLAG)
#define Get_DFSDM_DFSDM2_EXMIN(FLAG)         (*(uint32_t*)0x40017634 & FLAG)
#define Get_DFSDM_DFSDM3_EXMIN(FLAG)         (*(uint32_t*)0x400176b4 & FLAG)
#define Get_DFSDM_DFSDM0_CNVTIMR(FLAG)       (*(uint32_t*)0x40017538 & FLAG)
#define Get_DFSDM_DFSDM1_CNVTIMR(FLAG)       (*(uint32_t*)0x400175b8 & FLAG)
#define Get_DFSDM_DFSDM2_CNVTIMR(FLAG)       (*(uint32_t*)0x40017638 & FLAG)
#define Get_DFSDM_DFSDM3_CNVTIMR(FLAG)       (*(uint32_t*)0x400176b8 & FLAG)
#define Set_DFSDM_DFSDM_CHCFG0R1(FLAG)       (*(uint32_t*)0x40017400 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG0R1(FLAG)       (*(uint32_t*)0x40017400 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG1R1(FLAG)       (*(uint32_t*)0x40017420 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG1R1(FLAG)       (*(uint32_t*)0x40017420 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG2R1(FLAG)       (*(uint32_t*)0x40017440 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG2R1(FLAG)       (*(uint32_t*)0x40017440 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG3R1(FLAG)       (*(uint32_t*)0x40017460 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG3R1(FLAG)       (*(uint32_t*)0x40017460 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG4R1(FLAG)       (*(uint32_t*)0x40017480 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG4R1(FLAG)       (*(uint32_t*)0x40017480 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG5R1(FLAG)       (*(uint32_t*)0x400174a0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG5R1(FLAG)       (*(uint32_t*)0x400174a0 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG6R1(FLAG)       (*(uint32_t*)0x400174c0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG6R1(FLAG)       (*(uint32_t*)0x400174c0 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG7R1(FLAG)       (*(uint32_t*)0x400174e0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG7R1(FLAG)       (*(uint32_t*)0x400174e0 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG0R2(FLAG)       (*(uint32_t*)0x40017404 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG0R2(FLAG)       (*(uint32_t*)0x40017404 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG1R2(FLAG)       (*(uint32_t*)0x40017424 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG1R2(FLAG)       (*(uint32_t*)0x40017424 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG2R2(FLAG)       (*(uint32_t*)0x40017444 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG2R2(FLAG)       (*(uint32_t*)0x40017444 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG3R2(FLAG)       (*(uint32_t*)0x40017464 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG3R2(FLAG)       (*(uint32_t*)0x40017464 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG4R2(FLAG)       (*(uint32_t*)0x40017484 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG4R2(FLAG)       (*(uint32_t*)0x40017484 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG5R2(FLAG)       (*(uint32_t*)0x400174a4 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG5R2(FLAG)       (*(uint32_t*)0x400174a4 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG6R2(FLAG)       (*(uint32_t*)0x400174c4 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG6R2(FLAG)       (*(uint32_t*)0x400174c4 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHCFG7R2(FLAG)       (*(uint32_t*)0x400174e4 |= FLAG)
#define Clr_DFSDM_DFSDM_CHCFG7R2(FLAG)       (*(uint32_t*)0x400174e4 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD0R(FLAG)        (*(uint32_t*)0x40017408 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD0R(FLAG)        (*(uint32_t*)0x40017408 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD1R(FLAG)        (*(uint32_t*)0x40017428 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD1R(FLAG)        (*(uint32_t*)0x40017428 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD2R(FLAG)        (*(uint32_t*)0x40017448 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD2R(FLAG)        (*(uint32_t*)0x40017448 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD3R(FLAG)        (*(uint32_t*)0x40017468 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD3R(FLAG)        (*(uint32_t*)0x40017468 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD4R(FLAG)        (*(uint32_t*)0x40017488 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD4R(FLAG)        (*(uint32_t*)0x40017488 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD5R(FLAG)        (*(uint32_t*)0x400174a8 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD5R(FLAG)        (*(uint32_t*)0x400174a8 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD6R(FLAG)        (*(uint32_t*)0x400174c8 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD6R(FLAG)        (*(uint32_t*)0x400174c8 &= ~FLAG)
#define Set_DFSDM_DFSDM_AWSCD7R(FLAG)        (*(uint32_t*)0x400174e8 |= FLAG)
#define Clr_DFSDM_DFSDM_AWSCD7R(FLAG)        (*(uint32_t*)0x400174e8 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT0R(FLAG)       (*(uint32_t*)0x4001740c |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT0R(FLAG)       (*(uint32_t*)0x4001740c &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT1R(FLAG)       (*(uint32_t*)0x4001742c |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT1R(FLAG)       (*(uint32_t*)0x4001742c &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT2R(FLAG)       (*(uint32_t*)0x4001744c |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT2R(FLAG)       (*(uint32_t*)0x4001744c &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT3R(FLAG)       (*(uint32_t*)0x4001746c |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT3R(FLAG)       (*(uint32_t*)0x4001746c &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT4R(FLAG)       (*(uint32_t*)0x4001748c |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT4R(FLAG)       (*(uint32_t*)0x4001748c &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT5R(FLAG)       (*(uint32_t*)0x400174ac |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT5R(FLAG)       (*(uint32_t*)0x400174ac &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT6R(FLAG)       (*(uint32_t*)0x400174cc |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT6R(FLAG)       (*(uint32_t*)0x400174cc &= ~FLAG)
#define Set_DFSDM_DFSDM_CHWDAT7R(FLAG)       (*(uint32_t*)0x400174ec |= FLAG)
#define Clr_DFSDM_DFSDM_CHWDAT7R(FLAG)       (*(uint32_t*)0x400174ec &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN0R(FLAG)      (*(uint32_t*)0x40017410 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN0R(FLAG)      (*(uint32_t*)0x40017410 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN1R(FLAG)      (*(uint32_t*)0x40017430 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN1R(FLAG)      (*(uint32_t*)0x40017430 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN2R(FLAG)      (*(uint32_t*)0x40017450 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN2R(FLAG)      (*(uint32_t*)0x40017450 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN3R(FLAG)      (*(uint32_t*)0x40017470 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN3R(FLAG)      (*(uint32_t*)0x40017470 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN4R(FLAG)      (*(uint32_t*)0x40017490 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN4R(FLAG)      (*(uint32_t*)0x40017490 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN5R(FLAG)      (*(uint32_t*)0x400174b0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN5R(FLAG)      (*(uint32_t*)0x400174b0 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN6R(FLAG)      (*(uint32_t*)0x400174d0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN6R(FLAG)      (*(uint32_t*)0x400174d0 &= ~FLAG)
#define Set_DFSDM_DFSDM_CHDATIN7R(FLAG)      (*(uint32_t*)0x400174f0 |= FLAG)
#define Clr_DFSDM_DFSDM_CHDATIN7R(FLAG)      (*(uint32_t*)0x400174f0 &= ~FLAG)
#define Set_DFSDM_DFSDM0_CR1(FLAG)           (*(uint32_t*)0x40017500 |= FLAG)
#define Clr_DFSDM_DFSDM0_CR1(FLAG)           (*(uint32_t*)0x40017500 &= ~FLAG)
#define Set_DFSDM_DFSDM1_CR1(FLAG)           (*(uint32_t*)0x40017580 |= FLAG)
#define Clr_DFSDM_DFSDM1_CR1(FLAG)           (*(uint32_t*)0x40017580 &= ~FLAG)
#define Set_DFSDM_DFSDM2_CR1(FLAG)           (*(uint32_t*)0x40017600 |= FLAG)
#define Clr_DFSDM_DFSDM2_CR1(FLAG)           (*(uint32_t*)0x40017600 &= ~FLAG)
#define Set_DFSDM_DFSDM3_CR1(FLAG)           (*(uint32_t*)0x40017780 |= FLAG)
#define Clr_DFSDM_DFSDM3_CR1(FLAG)           (*(uint32_t*)0x40017780 &= ~FLAG)
#define Set_DFSDM_DFSDM0_CR2(FLAG)           (*(uint32_t*)0x40017504 |= FLAG)
#define Clr_DFSDM_DFSDM0_CR2(FLAG)           (*(uint32_t*)0x40017504 &= ~FLAG)
#define Set_DFSDM_DFSDM1_CR2(FLAG)           (*(uint32_t*)0x40017584 |= FLAG)
#define Clr_DFSDM_DFSDM1_CR2(FLAG)           (*(uint32_t*)0x40017584 &= ~FLAG)
#define Set_DFSDM_DFSDM2_CR2(FLAG)           (*(uint32_t*)0x40017604 |= FLAG)
#define Clr_DFSDM_DFSDM2_CR2(FLAG)           (*(uint32_t*)0x40017604 &= ~FLAG)
#define Set_DFSDM_DFSDM3_CR2(FLAG)           (*(uint32_t*)0x40017784 |= FLAG)
#define Clr_DFSDM_DFSDM3_CR2(FLAG)           (*(uint32_t*)0x40017784 &= ~FLAG)
#define Set_DFSDM_DFSDM0_ISR(FLAG)           (*(uint32_t*)0x40017508 |= FLAG)
#define Clr_DFSDM_DFSDM0_ISR(FLAG)           (*(uint32_t*)0x40017508 &= ~FLAG)
#define Set_DFSDM_DFSDM1_ISR(FLAG)           (*(uint32_t*)0x40017588 |= FLAG)
#define Clr_DFSDM_DFSDM1_ISR(FLAG)           (*(uint32_t*)0x40017588 &= ~FLAG)
#define Set_DFSDM_DFSDM2_ISR(FLAG)           (*(uint32_t*)0x40017608 |= FLAG)
#define Clr_DFSDM_DFSDM2_ISR(FLAG)           (*(uint32_t*)0x40017608 &= ~FLAG)
#define Set_DFSDM_DFSDM3_ISR(FLAG)           (*(uint32_t*)0x40017788 |= FLAG)
#define Clr_DFSDM_DFSDM3_ISR(FLAG)           (*(uint32_t*)0x40017788 &= ~FLAG)
#define Set_DFSDM_DFSDM0_ICR(FLAG)           (*(uint32_t*)0x4001750c |= FLAG)
#define Clr_DFSDM_DFSDM0_ICR(FLAG)           (*(uint32_t*)0x4001750c &= ~FLAG)
#define Set_DFSDM_DFSDM1_ICR(FLAG)           (*(uint32_t*)0x4001758c |= FLAG)
#define Clr_DFSDM_DFSDM1_ICR(FLAG)           (*(uint32_t*)0x4001758c &= ~FLAG)
#define Set_DFSDM_DFSDM2_ICR(FLAG)           (*(uint32_t*)0x4001760c |= FLAG)
#define Clr_DFSDM_DFSDM2_ICR(FLAG)           (*(uint32_t*)0x4001760c &= ~FLAG)
#define Set_DFSDM_DFSDM3_ICR(FLAG)           (*(uint32_t*)0x4001778c |= FLAG)
#define Clr_DFSDM_DFSDM3_ICR(FLAG)           (*(uint32_t*)0x4001778c &= ~FLAG)
#define Set_DFSDM_DFSDM0_JCHGR(FLAG)         (*(uint32_t*)0x40017510 |= FLAG)
#define Clr_DFSDM_DFSDM0_JCHGR(FLAG)         (*(uint32_t*)0x40017510 &= ~FLAG)
#define Set_DFSDM_DFSDM1_JCHGR(FLAG)         (*(uint32_t*)0x40017590 |= FLAG)
#define Clr_DFSDM_DFSDM1_JCHGR(FLAG)         (*(uint32_t*)0x40017590 &= ~FLAG)
#define Set_DFSDM_DFSDM2_JCHGR(FLAG)         (*(uint32_t*)0x40017610 |= FLAG)
#define Clr_DFSDM_DFSDM2_JCHGR(FLAG)         (*(uint32_t*)0x40017610 &= ~FLAG)
#define Set_DFSDM_DFSDM3_JCHGR(FLAG)         (*(uint32_t*)0x40017710 |= FLAG)
#define Clr_DFSDM_DFSDM3_JCHGR(FLAG)         (*(uint32_t*)0x40017710 &= ~FLAG)
#define Set_DFSDM_DFSDM0_FCR(FLAG)           (*(uint32_t*)0x40017514 |= FLAG)
#define Clr_DFSDM_DFSDM0_FCR(FLAG)           (*(uint32_t*)0x40017514 &= ~FLAG)
#define Set_DFSDM_DFSDM1_FCR(FLAG)           (*(uint32_t*)0x40017594 |= FLAG)
#define Clr_DFSDM_DFSDM1_FCR(FLAG)           (*(uint32_t*)0x40017594 &= ~FLAG)
#define Set_DFSDM_DFSDM2_FCR(FLAG)           (*(uint32_t*)0x40017614 |= FLAG)
#define Clr_DFSDM_DFSDM2_FCR(FLAG)           (*(uint32_t*)0x40017614 &= ~FLAG)
#define Set_DFSDM_DFSDM3_FCR(FLAG)           (*(uint32_t*)0x40017714 |= FLAG)
#define Clr_DFSDM_DFSDM3_FCR(FLAG)           (*(uint32_t*)0x40017714 &= ~FLAG)
#define Set_DFSDM_DFSDM0_JDATAR(FLAG)        (*(uint32_t*)0x40017518 |= FLAG)
#define Clr_DFSDM_DFSDM0_JDATAR(FLAG)        (*(uint32_t*)0x40017518 &= ~FLAG)
#define Set_DFSDM_DFSDM1_JDATAR(FLAG)        (*(uint32_t*)0x40017598 |= FLAG)
#define Clr_DFSDM_DFSDM1_JDATAR(FLAG)        (*(uint32_t*)0x40017598 &= ~FLAG)
#define Set_DFSDM_DFSDM2_JDATAR(FLAG)        (*(uint32_t*)0x40017618 |= FLAG)
#define Clr_DFSDM_DFSDM2_JDATAR(FLAG)        (*(uint32_t*)0x40017618 &= ~FLAG)
#define Set_DFSDM_DFSDM3_JDATAR(FLAG)        (*(uint32_t*)0x40017718 |= FLAG)
#define Clr_DFSDM_DFSDM3_JDATAR(FLAG)        (*(uint32_t*)0x40017718 &= ~FLAG)
#define Set_DFSDM_DFSDM0_RDATAR(FLAG)        (*(uint32_t*)0x4001751c |= FLAG)
#define Clr_DFSDM_DFSDM0_RDATAR(FLAG)        (*(uint32_t*)0x4001751c &= ~FLAG)
#define Set_DFSDM_DFSDM1_RDATAR(FLAG)        (*(uint32_t*)0x40017598 |= FLAG)
#define Clr_DFSDM_DFSDM1_RDATAR(FLAG)        (*(uint32_t*)0x40017598 &= ~FLAG)
#define Set_DFSDM_DFSDM2_RDATAR(FLAG)        (*(uint32_t*)0x40017618 |= FLAG)
#define Clr_DFSDM_DFSDM2_RDATAR(FLAG)        (*(uint32_t*)0x40017618 &= ~FLAG)
#define Set_DFSDM_DFSDM3_RDATAR(FLAG)        (*(uint32_t*)0x40017718 |= FLAG)
#define Clr_DFSDM_DFSDM3_RDATAR(FLAG)        (*(uint32_t*)0x40017718 &= ~FLAG)
#define Set_DFSDM_DFSDM0_AWHTR(FLAG)         (*(uint32_t*)0x40017520 |= FLAG)
#define Clr_DFSDM_DFSDM0_AWHTR(FLAG)         (*(uint32_t*)0x40017520 &= ~FLAG)
#define Set_DFSDM_DFSDM1_AWHTR(FLAG)         (*(uint32_t*)0x400175a0 |= FLAG)
#define Clr_DFSDM_DFSDM1_AWHTR(FLAG)         (*(uint32_t*)0x400175a0 &= ~FLAG)
#define Set_DFSDM_DFSDM2_AWHTR(FLAG)         (*(uint32_t*)0x40017620 |= FLAG)
#define Clr_DFSDM_DFSDM2_AWHTR(FLAG)         (*(uint32_t*)0x40017620 &= ~FLAG)
#define Set_DFSDM_DFSDM3_AWHTR(FLAG)         (*(uint32_t*)0x400176a0 |= FLAG)
#define Clr_DFSDM_DFSDM3_AWHTR(FLAG)         (*(uint32_t*)0x400176a0 &= ~FLAG)
#define Set_DFSDM_DFSDM0_AWLTR(FLAG)         (*(uint32_t*)0x40017524 |= FLAG)
#define Clr_DFSDM_DFSDM0_AWLTR(FLAG)         (*(uint32_t*)0x40017524 &= ~FLAG)
#define Set_DFSDM_DFSDM1_AWLTR(FLAG)         (*(uint32_t*)0x400175a4 |= FLAG)
#define Clr_DFSDM_DFSDM1_AWLTR(FLAG)         (*(uint32_t*)0x400175a4 &= ~FLAG)
#define Set_DFSDM_DFSDM2_AWLTR(FLAG)         (*(uint32_t*)0x40017624 |= FLAG)
#define Clr_DFSDM_DFSDM2_AWLTR(FLAG)         (*(uint32_t*)0x40017624 &= ~FLAG)
#define Set_DFSDM_DFSDM3_AWLTR(FLAG)         (*(uint32_t*)0x400176a4 |= FLAG)
#define Clr_DFSDM_DFSDM3_AWLTR(FLAG)         (*(uint32_t*)0x400176a4 &= ~FLAG)
#define Set_DFSDM_DFSDM0_AWSR(FLAG)          (*(uint32_t*)0x40017528 |= FLAG)
#define Clr_DFSDM_DFSDM0_AWSR(FLAG)          (*(uint32_t*)0x40017528 &= ~FLAG)
#define Set_DFSDM_DFSDM1_AWSR(FLAG)          (*(uint32_t*)0x400175a8 |= FLAG)
#define Clr_DFSDM_DFSDM1_AWSR(FLAG)          (*(uint32_t*)0x400175a8 &= ~FLAG)
#define Set_DFSDM_DFSDM2_AWSR(FLAG)          (*(uint32_t*)0x40017628 |= FLAG)
#define Clr_DFSDM_DFSDM2_AWSR(FLAG)          (*(uint32_t*)0x40017628 &= ~FLAG)
#define Set_DFSDM_DFSDM3_AWSR(FLAG)          (*(uint32_t*)0x400176a8 |= FLAG)
#define Clr_DFSDM_DFSDM3_AWSR(FLAG)          (*(uint32_t*)0x400176a8 &= ~FLAG)
#define Set_DFSDM_DFSDM0_AWCFR(FLAG)         (*(uint32_t*)0x4001752c |= FLAG)
#define Clr_DFSDM_DFSDM0_AWCFR(FLAG)         (*(uint32_t*)0x4001752c &= ~FLAG)
#define Set_DFSDM_DFSDM1_AWCFR(FLAG)         (*(uint32_t*)0x400175ac |= FLAG)
#define Clr_DFSDM_DFSDM1_AWCFR(FLAG)         (*(uint32_t*)0x400175ac &= ~FLAG)
#define Set_DFSDM_DFSDM2_AWCFR(FLAG)         (*(uint32_t*)0x4001762c |= FLAG)
#define Clr_DFSDM_DFSDM2_AWCFR(FLAG)         (*(uint32_t*)0x4001762c &= ~FLAG)
#define Set_DFSDM_DFSDM3_AWCFR(FLAG)         (*(uint32_t*)0x400176ac |= FLAG)
#define Clr_DFSDM_DFSDM3_AWCFR(FLAG)         (*(uint32_t*)0x400176ac &= ~FLAG)
#define Set_DFSDM_DFSDM0_EXMAX(FLAG)         (*(uint32_t*)0x40017530 |= FLAG)
#define Clr_DFSDM_DFSDM0_EXMAX(FLAG)         (*(uint32_t*)0x40017530 &= ~FLAG)
#define Set_DFSDM_DFSDM1_EXMAX(FLAG)         (*(uint32_t*)0x400175b0 |= FLAG)
#define Clr_DFSDM_DFSDM1_EXMAX(FLAG)         (*(uint32_t*)0x400175b0 &= ~FLAG)
#define Set_DFSDM_DFSDM2_EXMAX(FLAG)         (*(uint32_t*)0x40017630 |= FLAG)
#define Clr_DFSDM_DFSDM2_EXMAX(FLAG)         (*(uint32_t*)0x40017630 &= ~FLAG)
#define Set_DFSDM_DFSDM3_EXMAX(FLAG)         (*(uint32_t*)0x400176b0 |= FLAG)
#define Clr_DFSDM_DFSDM3_EXMAX(FLAG)         (*(uint32_t*)0x400176b0 &= ~FLAG)
#define Set_DFSDM_DFSDM0_EXMIN(FLAG)         (*(uint32_t*)0x40017534 |= FLAG)
#define Clr_DFSDM_DFSDM0_EXMIN(FLAG)         (*(uint32_t*)0x40017534 &= ~FLAG)
#define Set_DFSDM_DFSDM1_EXMIN(FLAG)         (*(uint32_t*)0x400175b4 |= FLAG)
#define Clr_DFSDM_DFSDM1_EXMIN(FLAG)         (*(uint32_t*)0x400175b4 &= ~FLAG)
#define Set_DFSDM_DFSDM2_EXMIN(FLAG)         (*(uint32_t*)0x40017634 |= FLAG)
#define Clr_DFSDM_DFSDM2_EXMIN(FLAG)         (*(uint32_t*)0x40017634 &= ~FLAG)
#define Set_DFSDM_DFSDM3_EXMIN(FLAG)         (*(uint32_t*)0x400176b4 |= FLAG)
#define Clr_DFSDM_DFSDM3_EXMIN(FLAG)         (*(uint32_t*)0x400176b4 &= ~FLAG)
#define Set_DFSDM_DFSDM0_CNVTIMR(FLAG)       (*(uint32_t*)0x40017538 |= FLAG)
#define Clr_DFSDM_DFSDM0_CNVTIMR(FLAG)       (*(uint32_t*)0x40017538 &= ~FLAG)
#define Set_DFSDM_DFSDM1_CNVTIMR(FLAG)       (*(uint32_t*)0x400175b8 |= FLAG)
#define Clr_DFSDM_DFSDM1_CNVTIMR(FLAG)       (*(uint32_t*)0x400175b8 &= ~FLAG)
#define Set_DFSDM_DFSDM2_CNVTIMR(FLAG)       (*(uint32_t*)0x40017638 |= FLAG)
#define Clr_DFSDM_DFSDM2_CNVTIMR(FLAG)       (*(uint32_t*)0x40017638 &= ~FLAG)
#define Set_DFSDM_DFSDM3_CNVTIMR(FLAG)       (*(uint32_t*)0x400176b8 |= FLAG)
#define Clr_DFSDM_DFSDM3_CNVTIMR(FLAG)       (*(uint32_t*)0x400176b8 &= ~FLAG)
#define  _DFSDM_DFSDM_CHCFG0R1_SITP                          (0x3 << 0)    // Serial interface type for channel 0
#define  _DFSDM_DFSDM_CHCFG0R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 0
#define  _DFSDM_DFSDM_CHCFG0R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 0
#define  _DFSDM_DFSDM_CHCFG0R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 0
#define  _DFSDM_DFSDM_CHCFG0R1_CHEN                          (0x1 << 7)    // Channel 0 enable
