7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_DFSDM.h
#define  _DFSDM_DFSDM_CHCFG0R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG0R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 0
#define  _DFSDM_DFSDM_CHCFG0R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG0R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG0R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG0R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG1R1_SITP                          (0x3 << 0)    // Serial interface type for channel 1
#define  _DFSDM_DFSDM_CHCFG1R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 1
#define  _DFSDM_DFSDM_CHCFG1R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 1
#define  _DFSDM_DFSDM_CHCFG1R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 1
#define  _DFSDM_DFSDM_CHCFG1R1_CHEN                          (0x1 << 7)    // Channel 1 enable
#define  _DFSDM_DFSDM_CHCFG1R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG1R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 1
#define  _DFSDM_DFSDM_CHCFG1R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG1R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG1R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG1R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG2R1_SITP                          (0x3 << 0)    // Serial interface type for channel 2
#define  _DFSDM_DFSDM_CHCFG2R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 2
#define  _DFSDM_DFSDM_CHCFG2R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 2
#define  _DFSDM_DFSDM_CHCFG2R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 2
#define  _DFSDM_DFSDM_CHCFG2R1_CHEN                          (0x1 << 7)    // Channel 2 enable
#define  _DFSDM_DFSDM_CHCFG2R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG2R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 2
#define  _DFSDM_DFSDM_CHCFG2R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG2R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG2R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG2R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG3R1_SITP                          (0x3 << 0)    // Serial interface type for channel 3
#define  _DFSDM_DFSDM_CHCFG3R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 3
#define  _DFSDM_DFSDM_CHCFG3R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 3
#define  _DFSDM_DFSDM_CHCFG3R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 3
#define  _DFSDM_DFSDM_CHCFG3R1_CHEN                          (0x1 << 7)    // Channel 3 enable
#define  _DFSDM_DFSDM_CHCFG3R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG3R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 3
#define  _DFSDM_DFSDM_CHCFG3R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG3R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG3R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG3R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG4R1_SITP                          (0x3 << 0)    // Serial interface type for channel 4
#define  _DFSDM_DFSDM_CHCFG4R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 4
#define  _DFSDM_DFSDM_CHCFG4R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 4
#define  _DFSDM_DFSDM_CHCFG4R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 4
#define  _DFSDM_DFSDM_CHCFG4R1_CHEN                          (0x1 << 7)    // Channel 4 enable
#define  _DFSDM_DFSDM_CHCFG4R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG4R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 4
#define  _DFSDM_DFSDM_CHCFG4R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG4R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG4R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG4R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG5R1_SITP                          (0x3 << 0)    // Serial interface type for channel 5
#define  _DFSDM_DFSDM_CHCFG5R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 5
#define  _DFSDM_DFSDM_CHCFG5R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 5
#define  _DFSDM_DFSDM_CHCFG5R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 5
#define  _DFSDM_DFSDM_CHCFG5R1_CHEN                          (0x1 << 7)    // Channel 5 enable
#define  _DFSDM_DFSDM_CHCFG5R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG5R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 5
#define  _DFSDM_DFSDM_CHCFG5R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG5R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG5R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG5R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG6R1_SITP                          (0x3 << 0)    // Serial interface type for channel 6
#define  _DFSDM_DFSDM_CHCFG6R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 6
#define  _DFSDM_DFSDM_CHCFG6R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 6
#define  _DFSDM_DFSDM_CHCFG6R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 6
#define  _DFSDM_DFSDM_CHCFG6R1_CHEN                          (0x1 << 7)    // Channel 6 enable
#define  _DFSDM_DFSDM_CHCFG6R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG6R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 6
#define  _DFSDM_DFSDM_CHCFG6R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG6R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG6R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG6R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG7R1_SITP                          (0x3 << 0)    // Serial interface type for channel 7
#define  _DFSDM_DFSDM_CHCFG7R1_SPICKSEL                      (0x3 << 2)    // SPI clock select for channel 7
#define  _DFSDM_DFSDM_CHCFG7R1_SCDEN                         (0x1 << 5)    // Short-circuit detector enable on channel 7
#define  _DFSDM_DFSDM_CHCFG7R1_CKABEN                        (0x1 << 6)    // Clock absence detector enable on channel 7
#define  _DFSDM_DFSDM_CHCFG7R1_CHEN                          (0x1 << 7)    // Channel 7 enable
#define  _DFSDM_DFSDM_CHCFG7R1_CHINSEL                       (0x1 << 8)    // Channel inputs selection
#define  _DFSDM_DFSDM_CHCFG7R1_DATMPX                        (0x3 << 12)    // Input data multiplexer for channel 7
#define  _DFSDM_DFSDM_CHCFG7R1_DATPACK                       (0x3 << 14)    // Data packing mode in DFSDM_CHDATINyR register
#define  _DFSDM_DFSDM_CHCFG7R1_CKOUTDIV                      (0xff << 16)    // Output serial clock divider
#define  _DFSDM_DFSDM_CHCFG7R1_CKOUTSRC                      (0x1 << 30)    // Output serial clock source selection
#define  _DFSDM_DFSDM_CHCFG7R1_DFSDMEN                       (0x1 << 31)    // Global enable for DFSDM interface
#define  _DFSDM_DFSDM_CHCFG0R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 0
#define  _DFSDM_DFSDM_CHCFG0R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 0
#define  _DFSDM_DFSDM_CHCFG1R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 1
#define  _DFSDM_DFSDM_CHCFG1R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 1
#define  _DFSDM_DFSDM_CHCFG2R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 2
#define  _DFSDM_DFSDM_CHCFG2R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 2
#define  _DFSDM_DFSDM_CHCFG3R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 3
#define  _DFSDM_DFSDM_CHCFG3R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 3
#define  _DFSDM_DFSDM_CHCFG4R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 4
#define  _DFSDM_DFSDM_CHCFG4R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 4
#define  _DFSDM_DFSDM_CHCFG5R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 5
#define  _DFSDM_DFSDM_CHCFG5R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 5
#define  _DFSDM_DFSDM_CHCFG6R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 6
#define  _DFSDM_DFSDM_CHCFG6R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 6
#define  _DFSDM_DFSDM_CHCFG7R2_DTRBS                         (0x1f << 3)    // Data right bit-shift for channel 7
#define  _DFSDM_DFSDM_CHCFG7R2_OFFSET                        (0xffffff << 8)    // 24-bit calibration offset for channel 7
#define  _DFSDM_DFSDM_AWSCD0R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 0
#define  _DFSDM_DFSDM_AWSCD0R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 0
#define  _DFSDM_DFSDM_AWSCD0R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 0
#define  _DFSDM_DFSDM_AWSCD0R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 0
#define  _DFSDM_DFSDM_AWSCD1R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 1
#define  _DFSDM_DFSDM_AWSCD1R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 1
#define  _DFSDM_DFSDM_AWSCD1R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 1
#define  _DFSDM_DFSDM_AWSCD1R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 1
#define  _DFSDM_DFSDM_AWSCD2R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 2
#define  _DFSDM_DFSDM_AWSCD2R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 2
#define  _DFSDM_DFSDM_AWSCD2R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 2
#define  _DFSDM_DFSDM_AWSCD2R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 2
#define  _DFSDM_DFSDM_AWSCD3R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 3
#define  _DFSDM_DFSDM_AWSCD3R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 3
#define  _DFSDM_DFSDM_AWSCD3R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 3
#define  _DFSDM_DFSDM_AWSCD3R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 3
#define  _DFSDM_DFSDM_AWSCD4R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 4
#define  _DFSDM_DFSDM_AWSCD4R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 4
#define  _DFSDM_DFSDM_AWSCD4R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 4
#define  _DFSDM_DFSDM_AWSCD4R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 4
#define  _DFSDM_DFSDM_AWSCD5R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 5
#define  _DFSDM_DFSDM_AWSCD5R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 5
#define  _DFSDM_DFSDM_AWSCD5R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 5
#define  _DFSDM_DFSDM_AWSCD5R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 5
#define  _DFSDM_DFSDM_AWSCD6R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 6
#define  _DFSDM_DFSDM_AWSCD6R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 6
#define  _DFSDM_DFSDM_AWSCD6R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 6
#define  _DFSDM_DFSDM_AWSCD6R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 6
#define  _DFSDM_DFSDM_AWSCD7R_SCDT                           (0xff << 0)    // short-circuit detector threshold for channel 7
#define  _DFSDM_DFSDM_AWSCD7R_BKSCD                          (0xf << 12)    // Break signal assignment for short-circuit detector on channel 7
#define  _DFSDM_DFSDM_AWSCD7R_AWFOSR                         (0x1f << 16)    // Analog watchdog filter oversampling ratio (decimation rate) on channel 7
#define  _DFSDM_DFSDM_AWSCD7R_AWFORD                         (0x3 << 22)    // Analog watchdog Sinc filter order on channel 7
#define  _DFSDM_DFSDM_CHWDAT0R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT1R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT2R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT3R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT4R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT5R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT6R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHWDAT7R_WDATA                         (0xffff << 0)    // Input channel y watchdog data
#define  _DFSDM_DFSDM_CHDATIN0R_INDAT0                       (0xffff << 0)    // Input data for channel 0
#define  _DFSDM_DFSDM_CHDATIN0R_INDAT1                       (0xffff << 16)    // Input data for channel 1
#define  _DFSDM_DFSDM_CHDATIN1R_INDAT0                       (0xffff << 0)    // Input data for channel 1
#define  _DFSDM_DFSDM_CHDATIN1R_INDAT1                       (0xffff << 16)    // Input data for channel 2
#define  _DFSDM_DFSDM_CHDATIN2R_INDAT0                       (0xffff << 0)    // Input data for channel 2
#define  _DFSDM_DFSDM_CHDATIN2R_INDAT1                       (0xffff << 16)    // Input data for channel 3
#define  _DFSDM_DFSDM_CHDATIN3R_INDAT0                       (0xffff << 0)    // Input data for channel 3
#define  _DFSDM_DFSDM_CHDATIN3R_INDAT1                       (0xffff << 16)    // Input data for channel 4
#define  _DFSDM_DFSDM_CHDATIN4R_INDAT0                       (0xffff << 0)    // Input data for channel 4
#define  _DFSDM_DFSDM_CHDATIN4R_INDAT1                       (0xffff << 16)    // Input data for channel 5
#define  _DFSDM_DFSDM_CHDATIN5R_INDAT0                       (0xffff << 0)    // Input data for channel 5
#define  _DFSDM_DFSDM_CHDATIN5R_INDAT1                       (0xffff << 16)    // Input data for channel 6
#define  _DFSDM_DFSDM_CHDATIN6R_INDAT0                       (0xffff << 0)    // Input data for channel 6
#define  _DFSDM_DFSDM_CHDATIN6R_INDAT1                       (0xffff << 16)    // Input data for channel 7
#define  _DFSDM_DFSDM_CHDATIN7R_INDAT0                       (0xffff << 0)    // Input data for channel 7
#define  _DFSDM_DFSDM_CHDATIN7R_INDAT1                       (0xffff << 16)    // Input data for channel 8
#define  _DFSDM_DFSDM0_CR1_DFEN                              (0x1 << 0)    // DFSDM enable
#define  _DFSDM_DFSDM0_CR1_JSWSTART                          (0x1 << 1)    // Start a conversion of the injected group of channels
#define  _DFSDM_DFSDM0_CR1_JSYNC                             (0x1 << 3)    // Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger
#define  _DFSDM_DFSDM0_CR1_JSCAN                             (0x1 << 4)    // Scanning conversion mode for injected conversions
#define  _DFSDM_DFSDM0_CR1_JDMAEN                            (0x1 << 5)    // DMA channel enabled to read data for the injected channel group
#define  _DFSDM_DFSDM0_CR1_JEXTSEL                           (0x1f << 8)    // Trigger signal selection for launching injected conversions
#define  _DFSDM_DFSDM0_CR1_JEXTEN                            (0x3 << 13)    // Trigger enable and trigger edge selection for injected conversions
#define  _DFSDM_DFSDM0_CR1_RSWSTART                          (0x1 << 17)    // Software start of a conversion on the regular channel
#define  _DFSDM_DFSDM0_CR1_RCONT                             (0x1 << 18)    // Continuous mode selection for regular conversions
#define  _DFSDM_DFSDM0_CR1_RSYNC                             (0x1 << 19)    // Launch regular conversion synchronously with DFSDM0
#define  _DFSDM_DFSDM0_CR1_RDMAEN                            (0x1 << 21)    // DMA channel enabled to read data for the regular conversion
#define  _DFSDM_DFSDM0_CR1_RCH                               (0x7 << 24)    // Regular channel selection
#define  _DFSDM_DFSDM0_CR1_FAST                              (0x1 << 29)    // Fast conversion mode selection for regular conversions
#define  _DFSDM_DFSDM0_CR1_AWFSEL                            (0x1 << 30)    // Analog watchdog fast mode select
#define  _DFSDM_DFSDM1_CR1_DFEN                              (0x1 << 0)    // DFSDM enable
#define  _DFSDM_DFSDM1_CR1_JSWSTART                          (0x1 << 1)    // Start a conversion of the injected group of channels
#define  _DFSDM_DFSDM1_CR1_JSYNC                             (0x1 << 3)    // Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger
#define  _DFSDM_DFSDM1_CR1_JSCAN                             (0x1 << 4)    // Scanning conversion mode for injected conversions
#define  _DFSDM_DFSDM1_CR1_JDMAEN                            (0x1 << 5)    // DMA channel enabled to read data for the injected channel group
#define  _DFSDM_DFSDM1_CR1_JEXTSEL                           (0x1f << 8)    // Trigger signal selection for launching injected conversions
#define  _DFSDM_DFSDM1_CR1_JEXTEN                            (0x3 << 13)    // Trigger enable and trigger edge selection for injected conversions
#define  _DFSDM_DFSDM1_CR1_RSWSTART                          (0x1 << 17)    // Software start of a conversion on the regular channel
#define  _DFSDM_DFSDM1_CR1_RCONT                             (0x1 << 18)    // Continuous mode selection for regular conversions
#define  _DFSDM_DFSDM1_CR1_RSYNC                             (0x1 << 19)    // Launch regular conversion synchronously with DFSDM0
#define  _DFSDM_DFSDM1_CR1_RDMAEN                            (0x1 << 21)    // DMA channel enabled to read data for the regular conversion
#define  _DFSDM_DFSDM1_CR1_RCH                               (0x7 << 24)    // Regular channel selection
#define  _DFSDM_DFSDM1_CR1_FAST                              (0x1 << 29)    // Fast conversion mode selection for regular conversions
#define  _DFSDM_DFSDM1_CR1_AWFSEL                            (0x1 << 30)    // Analog watchdog fast mode select
#define  _DFSDM_DFSDM2_CR1_DFEN                              (0x1 << 0)    // DFSDM enable
#define  _DFSDM_DFSDM2_CR1_JSWSTART                          (0x1 << 1)    // Start a conversion of the injected group of channels
#define  _DFSDM_DFSDM2_CR1_JSYNC                             (0x1 << 3)    // Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger
#define  _DFSDM_DFSDM2_CR1_JSCAN                             (0x1 << 4)    // Scanning conversion mode for injected conversions
#define  _DFSDM_DFSDM2_CR1_JDMAEN                            (0x1 << 5)    // DMA channel enabled to read data for the injected channel group
#define  _DFSDM_DFSDM2_CR1_JEXTSEL                           (0x1f << 8)    // Trigger signal selection for launching injected conversions
#define  _DFSDM_DFSDM2_CR1_JEXTEN                            (0x3 << 13)    // Trigger enable and trigger edge selection for injected conversions
#define  _DFSDM_DFSDM2_CR1_RSWSTART                          (0x1 << 17)    // Software start of a conversion on the regular channel
#define  _DFSDM_DFSDM2_CR1_RCONT                             (0x1 << 18)    // Continuous mode selection for regular conversions
#define  _DFSDM_DFSDM2_CR1_RSYNC                             (0x1 << 19)    // Launch regular conversion synchronously with DFSDM0
#define  _DFSDM_DFSDM2_CR1_RDMAEN                            (0x1 << 21)    // DMA channel enabled to read data for the regular conversion
#define  _DFSDM_DFSDM2_CR1_RCH                               (0x7 << 24)    // Regular channel selection
#define  _DFSDM_DFSDM2_CR1_FAST                              (0x1 << 29)    // Fast conversion mode selection for regular conversions
#define  _DFSDM_DFSDM2_CR1_AWFSEL                            (0x1 << 30)    // Analog watchdog fast mode select
#define  _DFSDM_DFSDM3_CR1_DFEN                              (0x1 << 0)    // DFSDM enable
#define  _DFSDM_DFSDM3_CR1_JSWSTART                          (0x1 << 1)    // Start a conversion of the injected group of channels
