7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_DFSDM.h
#define  _DFSDM_DFSDM3_CR1_JSYNC                             (0x1 << 3)    // Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger
#define  _DFSDM_DFSDM3_CR1_JSCAN                             (0x1 << 4)    // Scanning conversion mode for injected conversions
#define  _DFSDM_DFSDM3_CR1_JDMAEN                            (0x1 << 5)    // DMA channel enabled to read data for the injected channel group
#define  _DFSDM_DFSDM3_CR1_JEXTSEL                           (0x1f << 8)    // Trigger signal selection for launching injected conversions
#define  _DFSDM_DFSDM3_CR1_JEXTEN                            (0x3 << 13)    // Trigger enable and trigger edge selection for injected conversions
#define  _DFSDM_DFSDM3_CR1_RSWSTART                          (0x1 << 17)    // Software start of a conversion on the regular channel
#define  _DFSDM_DFSDM3_CR1_RCONT                             (0x1 << 18)    // Continuous mode selection for regular conversions
#define  _DFSDM_DFSDM3_CR1_RSYNC                             (0x1 << 19)    // Launch regular conversion synchronously with DFSDM0
#define  _DFSDM_DFSDM3_CR1_RDMAEN                            (0x1 << 21)    // DMA channel enabled to read data for the regular conversion
#define  _DFSDM_DFSDM3_CR1_RCH                               (0x7 << 24)    // Regular channel selection
#define  _DFSDM_DFSDM3_CR1_FAST                              (0x1 << 29)    // Fast conversion mode selection for regular conversions
#define  _DFSDM_DFSDM3_CR1_AWFSEL                            (0x1 << 30)    // Analog watchdog fast mode select
#define  _DFSDM_DFSDM0_CR2_JEOCIE                            (0x1 << 0)    // Injected end of conversion interrupt enable
#define  _DFSDM_DFSDM0_CR2_REOCIE                            (0x1 << 1)    // Regular end of conversion interrupt enable
#define  _DFSDM_DFSDM0_CR2_JOVRIE                            (0x1 << 2)    // Injected data overrun interrupt enable
#define  _DFSDM_DFSDM0_CR2_ROVRIE                            (0x1 << 3)    // Regular data overrun interrupt enable
#define  _DFSDM_DFSDM0_CR2_AWDIE                             (0x1 << 4)    // Analog watchdog interrupt enable
#define  _DFSDM_DFSDM0_CR2_SCDIE                             (0x1 << 5)    // Short-circuit detector interrupt enable
#define  _DFSDM_DFSDM0_CR2_CKABIE                            (0x1 << 6)    // Clock absence interrupt enable
#define  _DFSDM_DFSDM0_CR2_EXCH                              (0xff << 8)    // Extremes detector channel selection
#define  _DFSDM_DFSDM0_CR2_AWDCH                             (0xff << 16)    // Analog watchdog channel selection
#define  _DFSDM_DFSDM1_CR2_JEOCIE                            (0x1 << 0)    // Injected end of conversion interrupt enable
#define  _DFSDM_DFSDM1_CR2_REOCIE                            (0x1 << 1)    // Regular end of conversion interrupt enable
#define  _DFSDM_DFSDM1_CR2_JOVRIE                            (0x1 << 2)    // Injected data overrun interrupt enable
#define  _DFSDM_DFSDM1_CR2_ROVRIE                            (0x1 << 3)    // Regular data overrun interrupt enable
#define  _DFSDM_DFSDM1_CR2_AWDIE                             (0x1 << 4)    // Analog watchdog interrupt enable
#define  _DFSDM_DFSDM1_CR2_SCDIE                             (0x1 << 5)    // Short-circuit detector interrupt enable
#define  _DFSDM_DFSDM1_CR2_CKABIE                            (0x1 << 6)    // Clock absence interrupt enable
#define  _DFSDM_DFSDM1_CR2_EXCH                              (0xff << 8)    // Extremes detector channel selection
#define  _DFSDM_DFSDM1_CR2_AWDCH                             (0xff << 16)    // Analog watchdog channel selection
#define  _DFSDM_DFSDM2_CR2_JEOCIE                            (0x1 << 0)    // Injected end of conversion interrupt enable
#define  _DFSDM_DFSDM2_CR2_REOCIE                            (0x1 << 1)    // Regular end of conversion interrupt enable
#define  _DFSDM_DFSDM2_CR2_JOVRIE                            (0x1 << 2)    // Injected data overrun interrupt enable
#define  _DFSDM_DFSDM2_CR2_ROVRIE                            (0x1 << 3)    // Regular data overrun interrupt enable
#define  _DFSDM_DFSDM2_CR2_AWDIE                             (0x1 << 4)    // Analog watchdog interrupt enable
#define  _DFSDM_DFSDM2_CR2_SCDIE                             (0x1 << 5)    // Short-circuit detector interrupt enable
#define  _DFSDM_DFSDM2_CR2_CKABIE                            (0x1 << 6)    // Clock absence interrupt enable
#define  _DFSDM_DFSDM2_CR2_EXCH                              (0xff << 8)    // Extremes detector channel selection
#define  _DFSDM_DFSDM2_CR2_AWDCH                             (0xff << 16)    // Analog watchdog channel selection
#define  _DFSDM_DFSDM3_CR2_JEOCIE                            (0x1 << 0)    // Injected end of conversion interrupt enable
#define  _DFSDM_DFSDM3_CR2_REOCIE                            (0x1 << 1)    // Regular end of conversion interrupt enable
#define  _DFSDM_DFSDM3_CR2_JOVRIE                            (0x1 << 2)    // Injected data overrun interrupt enable
#define  _DFSDM_DFSDM3_CR2_ROVRIE                            (0x1 << 3)    // Regular data overrun interrupt enable
#define  _DFSDM_DFSDM3_CR2_AWDIE                             (0x1 << 4)    // Analog watchdog interrupt enable
#define  _DFSDM_DFSDM3_CR2_SCDIE                             (0x1 << 5)    // Short-circuit detector interrupt enable
#define  _DFSDM_DFSDM3_CR2_CKABIE                            (0x1 << 6)    // Clock absence interrupt enable
#define  _DFSDM_DFSDM3_CR2_EXCH                              (0xff << 8)    // Extremes detector channel selection
#define  _DFSDM_DFSDM3_CR2_AWDCH                             (0xff << 16)    // Analog watchdog channel selection
#define  _DFSDM_DFSDM0_ISR_JEOCF                             (0x1 << 0)    // End of injected conversion flag
#define  _DFSDM_DFSDM0_ISR_REOCF                             (0x1 << 1)    // End of regular conversion flag
#define  _DFSDM_DFSDM0_ISR_JOVRF                             (0x1 << 2)    // Injected conversion overrun flag
#define  _DFSDM_DFSDM0_ISR_ROVRF                             (0x1 << 3)    // Regular conversion overrun flag
#define  _DFSDM_DFSDM0_ISR_AWDF                              (0x1 << 4)    // Analog watchdog
#define  _DFSDM_DFSDM0_ISR_JCIP                              (0x1 << 13)    // Injected conversion in progress status
#define  _DFSDM_DFSDM0_ISR_RCIP                              (0x1 << 14)    // Regular conversion in progress status
#define  _DFSDM_DFSDM0_ISR_CKABF                             (0xff << 16)    // Clock absence flag
#define  _DFSDM_DFSDM0_ISR_SCDF                              (0xff << 24)    // short-circuit detector flag
#define  _DFSDM_DFSDM1_ISR_JEOCF                             (0x1 << 0)    // End of injected conversion flag
#define  _DFSDM_DFSDM1_ISR_REOCF                             (0x1 << 1)    // End of regular conversion flag
#define  _DFSDM_DFSDM1_ISR_JOVRF                             (0x1 << 2)    // Injected conversion overrun flag
#define  _DFSDM_DFSDM1_ISR_ROVRF                             (0x1 << 3)    // Regular conversion overrun flag
#define  _DFSDM_DFSDM1_ISR_AWDF                              (0x1 << 4)    // Analog watchdog
#define  _DFSDM_DFSDM1_ISR_JCIP                              (0x1 << 13)    // Injected conversion in progress status
#define  _DFSDM_DFSDM1_ISR_RCIP                              (0x1 << 14)    // Regular conversion in progress status
#define  _DFSDM_DFSDM1_ISR_CKABF                             (0xff << 16)    // Clock absence flag
#define  _DFSDM_DFSDM1_ISR_SCDF                              (0xff << 24)    // short-circuit detector flag
#define  _DFSDM_DFSDM2_ISR_JEOCF                             (0x1 << 0)    // End of injected conversion flag
#define  _DFSDM_DFSDM2_ISR_REOCF                             (0x1 << 1)    // End of regular conversion flag
#define  _DFSDM_DFSDM2_ISR_JOVRF                             (0x1 << 2)    // Injected conversion overrun flag
#define  _DFSDM_DFSDM2_ISR_ROVRF                             (0x1 << 3)    // Regular conversion overrun flag
#define  _DFSDM_DFSDM2_ISR_AWDF                              (0x1 << 4)    // Analog watchdog
#define  _DFSDM_DFSDM2_ISR_JCIP                              (0x1 << 13)    // Injected conversion in progress status
#define  _DFSDM_DFSDM2_ISR_RCIP                              (0x1 << 14)    // Regular conversion in progress status
#define  _DFSDM_DFSDM2_ISR_CKABF                             (0xff << 16)    // Clock absence flag
#define  _DFSDM_DFSDM2_ISR_SCDF                              (0xff << 24)    // short-circuit detector flag
#define  _DFSDM_DFSDM3_ISR_JEOCF                             (0x1 << 0)    // End of injected conversion flag
#define  _DFSDM_DFSDM3_ISR_REOCF                             (0x1 << 1)    // End of regular conversion flag
#define  _DFSDM_DFSDM3_ISR_JOVRF                             (0x1 << 2)    // Injected conversion overrun flag
#define  _DFSDM_DFSDM3_ISR_ROVRF                             (0x1 << 3)    // Regular conversion overrun flag
#define  _DFSDM_DFSDM3_ISR_AWDF                              (0x1 << 4)    // Analog watchdog
#define  _DFSDM_DFSDM3_ISR_JCIP                              (0x1 << 13)    // Injected conversion in progress status
#define  _DFSDM_DFSDM3_ISR_RCIP                              (0x1 << 14)    // Regular conversion in progress status
#define  _DFSDM_DFSDM3_ISR_CKABF                             (0xff << 16)    // Clock absence flag
#define  _DFSDM_DFSDM3_ISR_SCDF                              (0xff << 24)    // short-circuit detector flag
#define  _DFSDM_DFSDM0_ICR_CLRJOVRF                          (0x1 << 2)    // Clear the injected conversion overrun flag
#define  _DFSDM_DFSDM0_ICR_CLRROVRF                          (0x1 << 3)    // Clear the regular conversion overrun flag
#define  _DFSDM_DFSDM0_ICR_CLRCKABF                          (0xff << 16)    // Clear the clock absence flag
#define  _DFSDM_DFSDM0_ICR_CLRSCDF                           (0xff << 24)    // Clear the short-circuit detector flag
#define  _DFSDM_DFSDM1_ICR_CLRJOVRF                          (0x1 << 2)    // Clear the injected conversion overrun flag
#define  _DFSDM_DFSDM1_ICR_CLRROVRF                          (0x1 << 3)    // Clear the regular conversion overrun flag
#define  _DFSDM_DFSDM1_ICR_CLRCKABF                          (0xff << 16)    // Clear the clock absence flag
#define  _DFSDM_DFSDM1_ICR_CLRSCDF                           (0xff << 24)    // Clear the short-circuit detector flag
#define  _DFSDM_DFSDM2_ICR_CLRJOVRF                          (0x1 << 2)    // Clear the injected conversion overrun flag
#define  _DFSDM_DFSDM2_ICR_CLRROVRF                          (0x1 << 3)    // Clear the regular conversion overrun flag
#define  _DFSDM_DFSDM2_ICR_CLRCKABF                          (0xff << 16)    // Clear the clock absence flag
#define  _DFSDM_DFSDM2_ICR_CLRSCDF                           (0xff << 24)    // Clear the short-circuit detector flag
#define  _DFSDM_DFSDM3_ICR_CLRJOVRF                          (0x1 << 2)    // Clear the injected conversion overrun flag
#define  _DFSDM_DFSDM3_ICR_CLRROVRF                          (0x1 << 3)    // Clear the regular conversion overrun flag
#define  _DFSDM_DFSDM3_ICR_CLRCKABF                          (0xff << 16)    // Clear the clock absence flag
#define  _DFSDM_DFSDM3_ICR_CLRSCDF                           (0xff << 24)    // Clear the short-circuit detector flag
#define  _DFSDM_DFSDM0_JCHGR_JCHG                            (0xff << 0)    // Injected channel group selection
#define  _DFSDM_DFSDM1_JCHGR_JCHG                            (0xff << 0)    // Injected channel group selection
#define  _DFSDM_DFSDM2_JCHGR_JCHG                            (0xff << 0)    // Injected channel group selection
#define  _DFSDM_DFSDM3_JCHGR_JCHG                            (0xff << 0)    // Injected channel group selection
#define  _DFSDM_DFSDM0_FCR_IOSR                              (0xff << 0)    // Integrator oversampling ratio (averaging length)
#define  _DFSDM_DFSDM0_FCR_FOSR                              (0x3ff << 16)    // Sinc filter oversampling ratio (decimation rate)
#define  _DFSDM_DFSDM0_FCR_FORD                              (0x7 << 29)    // Sinc filter order
#define  _DFSDM_DFSDM1_FCR_IOSR                              (0xff << 0)    // Integrator oversampling ratio (averaging length)
#define  _DFSDM_DFSDM1_FCR_FOSR                              (0x3ff << 16)    // Sinc filter oversampling ratio (decimation rate)
#define  _DFSDM_DFSDM1_FCR_FORD                              (0x7 << 29)    // Sinc filter order
#define  _DFSDM_DFSDM2_FCR_IOSR                              (0xff << 0)    // Integrator oversampling ratio (averaging length)
#define  _DFSDM_DFSDM2_FCR_FOSR                              (0x3ff << 16)    // Sinc filter oversampling ratio (decimation rate)
#define  _DFSDM_DFSDM2_FCR_FORD                              (0x7 << 29)    // Sinc filter order
#define  _DFSDM_DFSDM3_FCR_IOSR                              (0xff << 0)    // Integrator oversampling ratio (averaging length)
#define  _DFSDM_DFSDM3_FCR_FOSR                              (0x3ff << 16)    // Sinc filter oversampling ratio (decimation rate)
#define  _DFSDM_DFSDM3_FCR_FORD                              (0x7 << 29)    // Sinc filter order
#define  _DFSDM_DFSDM0_JDATAR_JDATACH                        (0x7 << 0)    // Injected channel most recently converted
#define  _DFSDM_DFSDM0_JDATAR_JDATA                          (0xffffff << 8)    // Injected group conversion data
#define  _DFSDM_DFSDM1_JDATAR_JDATACH                        (0x7 << 0)    // Injected channel most recently converted
#define  _DFSDM_DFSDM1_JDATAR_JDATA                          (0xffffff << 8)    // Injected group conversion data
#define  _DFSDM_DFSDM2_JDATAR_JDATACH                        (0x7 << 0)    // Injected channel most recently converted
#define  _DFSDM_DFSDM2_JDATAR_JDATA                          (0xffffff << 8)    // Injected group conversion data
#define  _DFSDM_DFSDM3_JDATAR_JDATACH                        (0x7 << 0)    // Injected channel most recently converted
#define  _DFSDM_DFSDM3_JDATAR_JDATA                          (0xffffff << 8)    // Injected group conversion data
#define  _DFSDM_DFSDM0_RDATAR_RDATACH                        (0x7 << 0)    // Regular channel most recently converted
#define  _DFSDM_DFSDM0_RDATAR_RPEND                          (0x1 << 4)    // Regular channel pending data
#define  _DFSDM_DFSDM0_RDATAR_RDATA                          (0xffffff << 8)    // Regular channel conversion data
#define  _DFSDM_DFSDM1_RDATAR_RDATACH                        (0x7 << 0)    // Regular channel most recently converted
#define  _DFSDM_DFSDM1_RDATAR_RPEND                          (0x1 << 4)    // Regular channel pending data
#define  _DFSDM_DFSDM1_RDATAR_RDATA                          (0xffffff << 8)    // Regular channel conversion data
#define  _DFSDM_DFSDM2_RDATAR_RDATACH                        (0x7 << 0)    // Regular channel most recently converted
#define  _DFSDM_DFSDM2_RDATAR_RPEND                          (0x1 << 4)    // Regular channel pending data
#define  _DFSDM_DFSDM2_RDATAR_RDATA                          (0xffffff << 8)    // Regular channel conversion data
#define  _DFSDM_DFSDM3_RDATAR_RDATACH                        (0x7 << 0)    // Regular channel most recently converted
#define  _DFSDM_DFSDM3_RDATAR_RPEND                          (0x1 << 4)    // Regular channel pending data
#define  _DFSDM_DFSDM3_RDATAR_RDATA                          (0xffffff << 8)    // Regular channel conversion data
#define  _DFSDM_DFSDM0_AWHTR_BKAWH                           (0xf << 0)    // Break signal assignment to analog watchdog high threshold event
#define  _DFSDM_DFSDM0_AWHTR_AWHT                            (0xffffff << 8)    // Analog watchdog high threshold
#define  _DFSDM_DFSDM1_AWHTR_BKAWH                           (0xf << 0)    // Break signal assignment to analog watchdog high threshold event
#define  _DFSDM_DFSDM1_AWHTR_AWHT                            (0xffffff << 8)    // Analog watchdog high threshold
#define  _DFSDM_DFSDM2_AWHTR_BKAWH                           (0xf << 0)    // Break signal assignment to analog watchdog high threshold event
#define  _DFSDM_DFSDM2_AWHTR_AWHT                            (0xffffff << 8)    // Analog watchdog high threshold
#define  _DFSDM_DFSDM3_AWHTR_BKAWH                           (0xf << 0)    // Break signal assignment to analog watchdog high threshold event
#define  _DFSDM_DFSDM3_AWHTR_AWHT                            (0xffffff << 8)    // Analog watchdog high threshold
#define  _DFSDM_DFSDM0_AWLTR_BKAWL                           (0xf << 0)    // Break signal assignment to analog watchdog low threshold event
#define  _DFSDM_DFSDM0_AWLTR_AWLT                            (0xffffff << 8)    // Analog watchdog low threshold
#define  _DFSDM_DFSDM1_AWLTR_BKAWL                           (0xf << 0)    // Break signal assignment to analog watchdog low threshold event
#define  _DFSDM_DFSDM1_AWLTR_AWLT                            (0xffffff << 8)    // Analog watchdog low threshold
#define  _DFSDM_DFSDM2_AWLTR_BKAWL                           (0xf << 0)    // Break signal assignment to analog watchdog low threshold event
#define  _DFSDM_DFSDM2_AWLTR_AWLT                            (0xffffff << 8)    // Analog watchdog low threshold
#define  _DFSDM_DFSDM3_AWLTR_BKAWL                           (0xf << 0)    // Break signal assignment to analog watchdog low threshold event
#define  _DFSDM_DFSDM3_AWLTR_AWLT                            (0xffffff << 8)    // Analog watchdog low threshold
#define  _DFSDM_DFSDM0_AWSR_AWLTF                            (0xff << 0)    // Analog watchdog low threshold flag
#define  _DFSDM_DFSDM0_AWSR_AWHTF                            (0xff << 8)    // Analog watchdog high threshold flag
#define  _DFSDM_DFSDM1_AWSR_AWLTF                            (0xff << 0)    // Analog watchdog low threshold flag
#define  _DFSDM_DFSDM1_AWSR_AWHTF                            (0xff << 8)    // Analog watchdog high threshold flag
#define  _DFSDM_DFSDM2_AWSR_AWLTF                            (0xff << 0)    // Analog watchdog low threshold flag
#define  _DFSDM_DFSDM2_AWSR_AWHTF                            (0xff << 8)    // Analog watchdog high threshold flag
#define  _DFSDM_DFSDM3_AWSR_AWLTF                            (0xff << 0)    // Analog watchdog low threshold flag
#define  _DFSDM_DFSDM3_AWSR_AWHTF                            (0xff << 8)    // Analog watchdog high threshold flag
#define  _DFSDM_DFSDM0_AWCFR_CLRAWLTF                        (0xff << 0)    // Clear the analog watchdog low threshold flag
#define  _DFSDM_DFSDM0_AWCFR_CLRAWHTF                        (0xff << 8)    // Clear the analog watchdog high threshold flag
#define  _DFSDM_DFSDM1_AWCFR_CLRAWLTF                        (0xff << 0)    // Clear the analog watchdog low threshold flag
#define  _DFSDM_DFSDM1_AWCFR_CLRAWHTF                        (0xff << 8)    // Clear the analog watchdog high threshold flag
#define  _DFSDM_DFSDM2_AWCFR_CLRAWLTF                        (0xff << 0)    // Clear the analog watchdog low threshold flag
#define  _DFSDM_DFSDM2_AWCFR_CLRAWHTF                        (0xff << 8)    // Clear the analog watchdog high threshold flag
#define  _DFSDM_DFSDM3_AWCFR_CLRAWLTF                        (0xff << 0)    // Clear the analog watchdog low threshold flag
#define  _DFSDM_DFSDM3_AWCFR_CLRAWHTF                        (0xff << 8)    // Clear the analog watchdog high threshold flag
#define  _DFSDM_DFSDM0_EXMAX_EXMAXCH                         (0x7 << 0)    // Extremes detector maximum data channel
#define  _DFSDM_DFSDM0_EXMAX_EXMAX                           (0xffffff << 8)    // Extremes detector maximum value
#define  _DFSDM_DFSDM1_EXMAX_EXMAXCH                         (0x7 << 0)    // Extremes detector maximum data channel
#define  _DFSDM_DFSDM1_EXMAX_EXMAX                           (0xffffff << 8)    // Extremes detector maximum value
#define  _DFSDM_DFSDM2_EXMAX_EXMAXCH                         (0x7 << 0)    // Extremes detector maximum data channel
#define  _DFSDM_DFSDM2_EXMAX_EXMAX                           (0xffffff << 8)    // Extremes detector maximum value
#define  _DFSDM_DFSDM3_EXMAX_EXMAXCH                         (0x7 << 0)    // Extremes detector maximum data channel
#define  _DFSDM_DFSDM3_EXMAX_EXMAX                           (0xffffff << 8)    // Extremes detector maximum value
#define  _DFSDM_DFSDM0_EXMIN_EXMINCH                         (0x7 << 0)    // Extremes detector minimum data channel
#define  _DFSDM_DFSDM0_EXMIN_EXMIN                           (0xffffff << 8)    // Extremes detector minimum value
#define  _DFSDM_DFSDM1_EXMIN_EXMINCH                         (0x7 << 0)    // Extremes detector minimum data channel
#define  _DFSDM_DFSDM1_EXMIN_EXMIN                           (0xffffff << 8)    // Extremes detector minimum value
#define  _DFSDM_DFSDM2_EXMIN_EXMINCH                         (0x7 << 0)    // Extremes detector minimum data channel
#define  _DFSDM_DFSDM2_EXMIN_EXMIN                           (0xffffff << 8)    // Extremes detector minimum value
#define  _DFSDM_DFSDM3_EXMIN_EXMINCH                         (0x7 << 0)    // Extremes detector minimum data channel
#define  _DFSDM_DFSDM3_EXMIN_EXMIN                           (0xffffff << 8)    // Extremes detector minimum value
#define  _DFSDM_DFSDM0_CNVTIMR_CNVCNT                        (0xfffffff << 4)    // 28-bit timer counting conversion time
#define  _DFSDM_DFSDM1_CNVTIMR_CNVCNT                        (0xfffffff << 4)    // 28-bit timer counting conversion time
#define  _DFSDM_DFSDM2_CNVTIMR_CNVCNT                        (0xfffffff << 4)    // 28-bit timer counting conversion time
#define  _DFSDM_DFSDM3_CNVTIMR_CNVCNT                        (0xfffffff << 4)    // 28-bit timer counting conversion time
